theoim/wsm_driver/examples/network_install/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# Keep default warnings as warnings. ESP-IDF flipped this Kconfig default in 6.0
# (y in 5.5 -> n in 6.0). With it off the build uses -Werror instead of
# -Werror=all, so warnings outside -Wall become errors too -- including the
# preprocessor "redefined" warning the vendored ioLibrary trips. sdkconfig is
# gitignored, so without pinning it here the result depends on which IDF version
# happened to generate it first.
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# WIZnet chip defaults to W5500; switch to W6300 in menuconfig:
#   Component config -> WIZnet WSM Driver -> WIZnet chip
# --- wsm_driver shared settings (copied from loopback) ---
CONFIG_WSM_DRIVER_ENABLED=y
CONFIG_WSM_DRIVER_CHIP_W6300=y
CONFIG_WSM_DRIVER_BACKEND_TOE=y
# pins/clock/QSPI come from the component Kconfig W6300 defaults
# No BSD sockets here: this example only reads the chip's PHY registers, so the
# lwIP --wrap glue (and the ioLibrary close() rename it brings) is not needed.
CONFIG_WSM_DRIVER_SOCKET_WRAP=n
